src/cf/DataProcessors/ГенерацияПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ГенерацияПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодарочныхСертификатов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантГенерацииПодарочныхСертификатов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиапазонНомераС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиапазонНомераПо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольУникальностиНомеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодарочныеСертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ГенерацияПодарочныхСертификатов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидПодарочныхСертификатов") Тогда
		Объект.ВидПодарочныхСертификатов = Параметры.ВидПодарочныхСертификатов;
		ВидПодарочныхСертификатовПриИзмененииНаСервере();
	КонецЕсли;
	
	Объект.ВариантГенерацииПодарочныхСертификатов = "с номерами в указанном диапазоне";
	
	ОбновитьСостояниеКонтрольяУникальностиНомеров();   
	
	Объект.Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеКонтрольяУникальностиНомеров()
	ЕстьДублиНомеров = ПодарочныеСертификатыСервер.ЕстьДублиНомеровПодарочныхСертификатов();
	
	Элементы.КонтрольУникальностиНомеров.ТолькоПросмотр = ЕстьДублиНомеров;
	Элементы.КонтрольУникальностиНомеров.ОтображениеПодсказки = ?(ЕстьДублиНомеров, ОтображениеПодсказки.ОтображатьСправа, ОтображениеПодсказки.Нет);
	
	Объект.КонтрольУникальностиНомеров = ?(ЕстьДублиНомеров, "в рамках выбранного вида", 
										?(Константы.КонтролироватьУникальностьНомеровПодарочныхСертификатовПоВсемВидам.Получить(), 
											"по всем видам сертификатов", "в рамках выбранного вида"));
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьПодарочныеСертификаты()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодарочныеСертификаты.Ссылка КАК ПодарочныйСертификат
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|ГДЕ
		|	ПодарочныеСертификаты.Владелец = &ВидПодарочныхСертификатов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодарочныеСертификаты.Код";
	
	Запрос.УстановитьПараметр("ВидПодарочныхСертификатов", Объект.ВидПодарочныхСертификатов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ПодарочныеСертификаты.Загрузить(РезультатЗапроса.Выгрузить());	
КонецПроцедуры

&НаСервере
Процедура ВидПодарочныхСертификатовПриИзмененииНаСервере()
	Объект.ШаблонНомера = ПолучитьШаблонНомеровПодарочныхСертификатов(Объект.ВидПодарочныхСертификатов);
	Элементы.ДиапазонНомераС.Маска = Объект.ШаблонНомера;
	Элементы.ДиапазонНомераПо.Маска = Объект.ШаблонНомера;
	
	ЗаполнитьПодарочныеСертификаты();
КонецПроцедуры

&НаКлиенте
Процедура ВидПодарочныхСертификатовПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ВидПодарочныхСертификатов) Тогда
		ВидПодарочныхСертификатовПриИзмененииНаСервере();
	Иначе
		Объект.ПодарочныеСертификаты.Очистить();
		Объект.ШаблонНомера = "";
		Объект.ДиапазонНомераС = "";
		Объект.ДиапазонНомераПо = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантГенерацииПодарочныхСертификатовПриИзменении(Элемент)
	Элементы.ГруппаДиапазонНомеровПодарочныхСертификатов.Видимость = 
		Объект.ВариантГенерацииПодарочныхСертификатов = "с номерами в указанном диапазоне";
КонецПроцедуры

&НаКлиенте
Процедура ВариантГенерацииПодарочныхСертификатовОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КонтрольУникальностиНомеровПриИзмененииНаСервере(КонтрольУникальностиНомеров)
	Константы.КонтролироватьУникальностьНомеровПодарочныхСертификатовПоВсемВидам.Установить(КонтрольУникальностиНомеров = "по всем видам сертификатов");
КонецПроцедуры

&НаКлиенте
Процедура КонтрольУникальностиНомеровПриИзменении(Элемент)
	КонтрольУникальностиНомеровПриИзмененииНаСервере(Объект.КонтрольУникальностиНомеров);
КонецПроцедуры

&НаСервере
Функция СгенерироватьПодарочныеСертификатыНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Результат = ОбъектОбработки.СгенерироватьПодарочныеСертификаты();
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СгенерироватьПодарочныеСертификаты(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветНаВопросОГенерацииПодарочныхСертификатов", ЭтотОбъект);
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Сгенерировать подарочные сертификаты%1%2?'"),
								Символы.ПС,
								НСтр("ru = '" + Объект.ВариантГенерацииПодарочныхСертификатов + "'"));
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветНаВопросОГенерацииПодарочныхСертификатов(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если СгенерироватьПодарочныеСертификатыНаСервере() Тогда
			ОбновитьСостояниеКонтрольяУникальностиНомеров();
			ПоказатьОповещениеПользователя(НСтр("ru = 'Подарочные сертификаты успешно сгенерированы'"));
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьШаблонНомеровПодарочныхСертификатов(ВидПодарочныхСертификатов)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПодарочныхСертификатов, "ШаблонНомера");		
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокСертификатов(Команда)
	ЗаполнитьПодарочныеСертификаты();
КонецПроцедуры

&НаКлиенте
Процедура ПодарочныеСертификатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Объект.ПодарочныеСертификаты.НайтиПоИдентификатору(ВыбраннаяСтрока).ПодарочныйСертификат);
КонецПроцедуры
